Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/death/money_matters_after_a_death/financial_assistance_following_a_bereavement.html.txt.tmx
Source language: en
Languages: ga

source: Financial assistance following a bereavement
ga: Cúnamh airgeadais tar éis báis

source: A bereavement may leave dependants in short- or long-term financial need
ga: Tar éis báis do dhuine den chlann is minic go mbíonn daoine cleithiúnacha fágtha i gcruachas ó thaobh airgid de, go gearr théarmach nó go fad théarmach

source: There are certain once-off payments in Ireland (provided by the Department of Social Protection) that are available to help out families during this difficult time
ga: Tá íocaíochtaí áirithe ar fáil ón Roinn Coimirce Sóisialaí chun cuidiú leis an gclann i rith an tréimhse deacair seo

source: You must fulfil certain PRSI requirements to be eligible for some of the payments
ga: Tá coinníollacha áirithe ÁSPC a chaithfidh tú a chomhlíonadh chun go mbeifeá i dteideal chuid de na híocaíochtaí leasa shóisialaigh

source: You may be eligible for other payments if you pass a means test or if you are in urgent need no matter what your means
ga: D'fhéadfá a bheith i dteideal roinnt íocaíochtaí eile, bunaithe ar scrúdú maoine nó má tá géarghá agat leis is cuma cén maoin atá agat

source: If you have long-term needs, you may qualify for short- or long-term social welfare payments or for Rent Supplements
ga: Má tá riachtanaisí fad-téarmach agat, d'fhéadfá a bheith i dteideal íocaíochtaí leasa shóisialaigh gearr nó fad théarmach, nó Fordheontais Cíos

source: Rent or mortgage payments
ga: Íocaíochta cíosa nó morgáiste

source: If you have difficulty in paying your rent, you may be eligible for Rent Supplement
ga: Má tá deacrachtaí agat le do chuid íocaíochtaí cíosa, d'fhéadfá a bheith i dteideal an Fordheontais Cíos

source: Our document on Mortgage Protection provides information on insurance that is designed to pay off your mortgage in full
ga: Soláthraíonn ár ndoiciméad faoi Cosaint Morgáiste eolas ar árachais go bhfuil a ceapadh chun íoc as do mhorgáiste go hiomlán

source: Short- or long-term social welfare payment
ga: Íocaíochtaí gearr nó fad théarmacha leasa shóisialaigh

source: You may also be eligible for continued payment of the deceased's social welfare payment after his/her death or for a longer term social welfare pension, allowance or payment
ga: D'fhéadfá freisin a bheith i dteideal íocaíochtaí leasa shóisialaigh an té a cailleadh taréis a b(h)áis, nó i gcomhair pinsean, íocaíocht nó liúntas leasa shóisialaigh níos fad théarmach

source: There is more information in our document on benefits and entitlements following a death
ga: Tá tuilleadh eolais inár ndoiciméad ar shochair agus teidlíochtaí tar éis báis

source: Information for those affected by bereavement is a publication produced by the Citizens Information Board
ga: Is foilseachán é Eolas don lucht méala arna fhoilsiú ag An Bord um Fhaisnéis do Shaoránaigh

source: The booklet has been specially written to assist those following a bereavement
ga: Tá an leabhrán seo scríofa go speisialta chun cabhrú leis an lucht méala

source: It includes information on managing your money and dealing with finanancial difficulties, dealing with the deceased's debts, dormant bank accounts, legal matters, inheritance, wills, etc
ga: Tá eolas ann ar bhainistíocht do chuid airgid agus déileáil le deacrachtaí airgeadais, déileáil le fiacha an té atá básaithe, cuntais bhainc dhíomhaoine, ábhair dhlí, oidhreacht, uachtanna, srl

source: This booklet is also available from your nearest Citizen Information Centre. Where to apply
ga: Tá an leabhrán seo ar fáil freisin ón Ionad Eolais do Shaoránaigh is gaire duit
